{"pages":[{"title":"Who am I ?","text":"Who Are You?My name is Waris Radji, I’m 19 years old, and I presently learning computer science at Université de Paris 13. I have been working at Laboratoire Scientifique de Paris Nord (LIPN - CNRS) as a Scala Developer to implement an unsupervised learning algorithm in the Clustering4Ever library. I’m also a high-level Street Lifting athlete in the Fundamental Strength Project (FSP) team. My goal is to become a doctor in Machine Learning. This is my first blog and I hope you will like it.Why Are You Blogging?I think that knowledge is some things that have to be shared to permit our entire community to evolve. As a very large consumer of blog posts, I feel I even have to share. The best way to know if you have understood a concept is to see if you can explain it.What Are You Going To Be Blogging About?Even if this blog will principally deal with Data Science, Procedural Generation and Programming (mainly in Scala, affirmative it is my favorite language), I would also talk about technology in general, sport (particularly on Street lifting with training methods and statistical analyses) and anything else that comes to mind.Who Are You Writing For?I write for anyone on this planet who has a sense of curiosity and a thirst for learning. I really hope to be able to facilitate beginner developers to be more advanced in their early days. If you feel you’re being targeted by my sentences above, I welcome you!How Can They Get Involved?I am open to all constructive comments, especially in my writing, as I am just starting out. Anyone who desires to write an article on my blog is welcome and feel free to recommend new topics. We’ll all move forward together!","link":"/about/index.html"},{"title":"Projects","text":"A non-exhaustive list of open-source projects to which I have contributed.Clustering4EverA Big Data Clustering Library gathering clustering, unsupervized algorithms, and quality indices.See MoreSnake Scala.jsA very simple reproduction of the snake game made with Scala.js library.See MoreBreak-Out Scala.jsA simple reproduction of the break-out game made with Scala.js library.See MoreThe Biggest Scala Cheat SheetA big (very big) cheat sheet on the basic notions of scala.See MoreAnt Colony SimulatorAn intelligent ant colony that shows how ants search for food.See MoreScalaMazeA little library that implement some procedural maze generation algorithm in Scala.See More","link":"/projects/index.html"},{"title":"My services","text":"Programming &amp; Algorithm coursesBasic notions of algorithms, and programming languages Scala, Java, Python, JavaScript, HTML, CSS, SQL. In Paris area only.between $15 and $35 per hourShowcase WebsiteCreation of showcase website with SEO referencing included.on quotationNotification botNotification bot for Twitter, Telegram, Messenger, WhatsApp, Discord and more platforms.between $35 and $60 per botWeb ScrappingMassive data collection from any website to any format (JSON, CSV, SQL, etc.)$5 for each 1000 recordsAlgorithm implementationImplementation of mathematical or scientific algorithms only in Java, Scala and Python programming languages.on quotationHow to access my services ?Contact me by email: wradji64@gmail.com write your requests, and we can discuss them!","link":"/services/index.html"}],"posts":[{"title":"Deploying Scala.js app on Github Pages with Travis CI.","text":"Today we are going to use Travis CI (free for an open-source repository) to deploy continuously a Scala.js app on Github pages. All your commit on the master branch put your static files on a gh-pages branch once the test is validated.Scala.js is a compiler that compiles Scala source code to equivalent Javascript code.Li Haoyi : http://www.lihaoyi.com/hands-on-scala-js/Travis CI is a hosted continuous integration service used to build and test software projects hosted at GitHub.Wikipedia : https://en.wikipedia.org/wiki/Travis_CIPrerequisitesBefore following this tutorial, you need to download and install sbt and Node.js, and have an Github account.Create the projectRun the following command:1sbt new scala/hello-world.g8, and enter a name for your project. This creates a Scala project from the “hello-world” template.Setup Scala.jsIf you want to start from scratch without Scala.js project you can do this step.Create the file project/plugins.sbt, and add the following line to adding the Scala.js sbt plugin:1addSbtPlugin(\"org.scala-js\" % \"sbt-scalajs\" % \"0.6.29\")We also setup basic project settings and enable this plugin in the sbt build file. Add this following line in the build.sbt (in the project root directory) :12enablePlugins(ScalaJSPlugin)scalaJSUseMainModuleInitializer := trueTo run this, simply launch sbt and invoke the run task:1234567$ sbt run[info] Compilation completed in 9.96s.[info] Done compiling.[info] Fast optimizing D:\\drafs\\scala.js-travis-ci\\scala-travis\\target\\scala-2.13\\hello-world-fastopt.js[info] Running MainHello, World![success] (...)The run task creates the hello-world-fastopt.js in target\\scala-2.13\\ directory. Remember the name of the file for later.Integrating with HTMLTo load and launch the created JavaScript, you will need an HTML file.Create the folder source in the root directory of your project. You will put all your sources files (html, image, script, style) in this folder.Create the file source/index.html with the following content.1234567891011121314&lt;!DOCTYPE html&gt;&lt;html&gt;&lt;head&gt; &lt;meta charset=\"UTF-8\"&gt; &lt;title&gt;Scala.js App&lt;/title&gt;&lt;/head&gt;&lt;body&gt; &lt;!-- Include Scala.js compiled code --&gt; &lt;script type=\"text/javascript\" src=\"js/hello-world-fastopt.js\"&gt;&lt;/script&gt;&lt;/body&gt;&lt;/html&gt;Create the Github repositoryAdd .gitignore file in the root folder of your project, with the following content:123456789101112*.class*.log.cache/.history/.lib/dist/*target/lib_managed/src_managed/project/boot/project/plugins/project/And follow this tutorial to add an existing project to GitHub using the command line. Your repository should be public if you want to use Travis CI for free.Setup Travis CIIn this part, I use the free version of Travis CI.First, you need to add Travis CI application to your Github account.Generate a new token with repo scopes. Remember the token value for later.Go to Applications settings, and configure Travis CI to have access to the repository. You’ll be redirected to the Travis page.On the Travis page, go to your repository’s setting. Under Environment Variables, put GH_TOKEN as name and paste the token onto value. Click Add to save it.Earlier we created the source folder to place the static files of our app in it. To generate static files Travis CI copies the content of a public folder to the root of a project and commits it to the gh-pages branch. We will create a script to move our static files to a public folder.Add and commit deploy.sh file to your repository to generate static files on Travis CI with the following content:1234567891011121314if [ ! -d \"public\" ]; then mkdir publicficp -fr source/* public/if [ ! -d \"public/js\" ]; then mkdir public/jsfi# Generate .js files from Scalasbt fastOptJScp target/scala-*/*.js public/js/Add and commit .travis.yml file to your repository to configure Travis CI with the following content:123456789101112131415161718language: scalajdk: openjdk8scala: - 2.12.10 # scala version branches: only: - master # build master branch onlyscript: - bash deploy.sh # generate static filesdeploy: provider: pages skip-cleanup: true github-token: $GH_TOKEN keep-history: true on: branch: master local-dir: publicOnce Travis CI finish the deployment, the generated pages can be found in the gh-pages branch of your repository.Your Scala.js App is deployed on Github Pages !In your GitHub repository setting, navigate to “GitHub Pages” section and change Source to gh-pages branch.Congratulations! Your Scala.js app is ready and available at username.github.io/repository-name. The Scala code:123object Main extends App { println(\"Hello, World!\")}a well executed (see console).You can find all the source code used in this tutorial here.To go furtherYou will go further in your projects than a simple “Hello World”. For more information on Scala.js, I invite you to consult the official documentation.Sources:https://www.scala-js.org/doc/tutorial/basic/index.htmlhttps://docs.travis-ci.com/user/languages/scala/https://docs.travis-ci.com/user/deployment/pages/","link":"/2019/11/08/How-to-deploy-Scala-js-app-on-Github-Pages-with-Travis-CI/"},{"title":"Hello World !","text":"Welcome to the launch of my new and 1st website! My name is Waris Radji and I’m so excited to share with you my knowledge! The amount of ideas, how-to’s and inspiration whirling around in my head is ready to jump out.Where can I find information about you?For additional information about me and why I am writing this blog, I encourage you to go to the about page. But to summarize, I will mainly write articles about my passions, Scala programming, Data Science and Street Lifting to cite some examples.How can I get involved?Feel free to take part in my journey by suggesting ideas for articles and even writing articles on my blog yourself, it will be a pleasure! Comments, donations, and sharing are also welcome!How can I be informed?To keep you informed of my future posts I invite you to follow me on my social networks (on the left) and even better on my newsletter (on the right) where you’ll be informed each week of my latest posts. Subscribers to my newsletter will be able to receive small gifts! Keep a close eye on your mailbox.","link":"/2019/10/31/hello/"}],"tags":[{"name":"scala.js","slug":"scala-js","link":"/tags/scala-js/"},{"name":"github pages","slug":"github-pages","link":"/tags/github-pages/"},{"name":"travis ci","slug":"travis-ci","link":"/tags/travis-ci/"},{"name":"scala.js tutorial","slug":"scala-js-tutorial","link":"/tags/scala-js-tutorial/"},{"name":"scala.js examples","slug":"scala-js-examples","link":"/tags/scala-js-examples/"},{"name":"compile scala to js","slug":"compile-scala-to-js","link":"/tags/compile-scala-to-js/"},{"name":"sbt","slug":"sbt","link":"/tags/sbt/"},{"name":"about me","slug":"about-me","link":"/tags/about-me/"},{"name":"waris radji","slug":"waris-radji","link":"/tags/waris-radji/"}],"categories":[{"name":"Computer Science","slug":"Computer-Science","link":"/categories/Computer-Science/"}]}